grevaillot/svd_tools/headers/STM32F7x9/dma2.h
#define DMA2_S0CR_DIR_SHIFT		6
#define DMA2_S0CR_DIR_MASK		0x03
/** @defgroup dma2_s0cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA2_S0CR_PFCTRL Peripheral flow controller **/
#define DMA2_S0CR_PFCTRL		(1 << 5)
/** DMA2_S0CR_TCIE Transfer complete interrupt enable **/
#define DMA2_S0CR_TCIE		(1 << 4)
/** DMA2_S0CR_HTIE Half transfer interrupt enable **/
#define DMA2_S0CR_HTIE		(1 << 3)
/** DMA2_S0CR_TEIE Transfer error interrupt enable **/
#define DMA2_S0CR_TEIE		(1 << 2)
/** DMA2_S0CR_DMEIE Direct mode error interrupt enable **/
#define DMA2_S0CR_DMEIE		(1 << 1)
/** DMA2_S0CR_EN Stream enable / flag stream ready when read low **/
#define DMA2_S0CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma2_s0ndtr S0NDTR stream x number of data register
@{*/


#define DMA2_S0NDTR_NDT_SHIFT		0
#define DMA2_S0NDTR_NDT_MASK		0xffff
/** @defgroup dma2_s0ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s0par S0PAR stream x peripheral address register
@{*/


#define DMA2_S0PAR_PA_SHIFT		0
#define DMA2_S0PAR_PA_MASK		0xffffffff
/** @defgroup dma2_s0par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s0m0ar S0M0AR stream x memory 0 address register
@{*/


#define DMA2_S0M0AR_M0A_SHIFT		0
#define DMA2_S0M0AR_M0A_MASK		0xffffffff
/** @defgroup dma2_s0m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s0m1ar S0M1AR stream x memory 1 address register
@{*/


#define DMA2_S0M1AR_M1A_SHIFT		0
#define DMA2_S0M1AR_M1A_MASK		0xffffffff
/** @defgroup dma2_s0m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s0fcr S0FCR stream x FIFO control register
@{*/

/** DMA2_S0FCR_FEIE FIFO error interrupt enable **/
#define DMA2_S0FCR_FEIE		(1 << 7)

#define DMA2_S0FCR_FS_SHIFT		3
#define DMA2_S0FCR_FS_MASK		0x07
/** @defgroup dma2_s0fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA2_S0FCR_DMDIS Direct mode disable **/
#define DMA2_S0FCR_DMDIS		(1 << 2)

#define DMA2_S0FCR_FTH_SHIFT		0
#define DMA2_S0FCR_FTH_MASK		0x03
/** @defgroup dma2_s0fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s1cr S1CR stream x configuration register
@{*/


#define DMA2_S1CR_CHSEL_SHIFT		25
#define DMA2_S1CR_CHSEL_MASK		0x0f
/** @defgroup dma2_s1cr_chsel CHSEL Channel selection
@{*/
/**@}*/


#define DMA2_S1CR_MBURST_SHIFT		23
#define DMA2_S1CR_MBURST_MASK		0x03
/** @defgroup dma2_s1cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA2_S1CR_PBURST_SHIFT		21
#define DMA2_S1CR_PBURST_MASK		0x03
/** @defgroup dma2_s1cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA2_S1CR_ACK ACK **/
#define DMA2_S1CR_ACK		(1 << 20)
/** DMA2_S1CR_CT Current target (only in double buffer mode) **/
#define DMA2_S1CR_CT		(1 << 19)
/** DMA2_S1CR_DBM Double buffer mode **/
#define DMA2_S1CR_DBM		(1 << 18)

#define DMA2_S1CR_PL_SHIFT		16
#define DMA2_S1CR_PL_MASK		0x03
/** @defgroup dma2_s1cr_pl PL Priority level
@{*/
/**@}*/

/** DMA2_S1CR_PINCOS Peripheral increment offset size **/
#define DMA2_S1CR_PINCOS		(1 << 15)

#define DMA2_S1CR_MSIZE_SHIFT		13
#define DMA2_S1CR_MSIZE_MASK		0x03
/** @defgroup dma2_s1cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA2_S1CR_PSIZE_SHIFT		11
#define DMA2_S1CR_PSIZE_MASK		0x03
/** @defgroup dma2_s1cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA2_S1CR_MINC Memory increment mode **/
#define DMA2_S1CR_MINC		(1 << 10)
/** DMA2_S1CR_PINC Peripheral increment mode **/
#define DMA2_S1CR_PINC		(1 << 9)
/** DMA2_S1CR_CIRC Circular mode **/
#define DMA2_S1CR_CIRC		(1 << 8)

#define DMA2_S1CR_DIR_SHIFT		6
#define DMA2_S1CR_DIR_MASK		0x03
/** @defgroup dma2_s1cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA2_S1CR_PFCTRL Peripheral flow controller **/
#define DMA2_S1CR_PFCTRL		(1 << 5)
/** DMA2_S1CR_TCIE Transfer complete interrupt enable **/
#define DMA2_S1CR_TCIE		(1 << 4)
/** DMA2_S1CR_HTIE Half transfer interrupt enable **/
#define DMA2_S1CR_HTIE		(1 << 3)
/** DMA2_S1CR_TEIE Transfer error interrupt enable **/
#define DMA2_S1CR_TEIE		(1 << 2)
/** DMA2_S1CR_DMEIE Direct mode error interrupt enable **/
#define DMA2_S1CR_DMEIE		(1 << 1)
/** DMA2_S1CR_EN Stream enable / flag stream ready when read low **/
#define DMA2_S1CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma2_s1ndtr S1NDTR stream x number of data register
@{*/


#define DMA2_S1NDTR_NDT_SHIFT		0
#define DMA2_S1NDTR_NDT_MASK		0xffff
/** @defgroup dma2_s1ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s1par S1PAR stream x peripheral address register
@{*/


#define DMA2_S1PAR_PA_SHIFT		0
#define DMA2_S1PAR_PA_MASK		0xffffffff
/** @defgroup dma2_s1par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s1m0ar S1M0AR stream x memory 0 address register
@{*/


#define DMA2_S1M0AR_M0A_SHIFT		0
#define DMA2_S1M0AR_M0A_MASK		0xffffffff
/** @defgroup dma2_s1m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s1m1ar S1M1AR stream x memory 1 address register
@{*/


#define DMA2_S1M1AR_M1A_SHIFT		0
#define DMA2_S1M1AR_M1A_MASK		0xffffffff
/** @defgroup dma2_s1m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s1fcr S1FCR stream x FIFO control register
@{*/

/** DMA2_S1FCR_FEIE FIFO error interrupt enable **/
#define DMA2_S1FCR_FEIE		(1 << 7)

#define DMA2_S1FCR_FS_SHIFT		3
#define DMA2_S1FCR_FS_MASK		0x07
/** @defgroup dma2_s1fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA2_S1FCR_DMDIS Direct mode disable **/
#define DMA2_S1FCR_DMDIS		(1 << 2)

#define DMA2_S1FCR_FTH_SHIFT		0
#define DMA2_S1FCR_FTH_MASK		0x03
/** @defgroup dma2_s1fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s2cr S2CR stream x configuration register
@{*/


#define DMA2_S2CR_CHSEL_SHIFT		25
#define DMA2_S2CR_CHSEL_MASK		0x0f
/** @defgroup dma2_s2cr_chsel CHSEL Channel selection
@{*/
/**@}*/


#define DMA2_S2CR_MBURST_SHIFT		23
#define DMA2_S2CR_MBURST_MASK		0x03
/** @defgroup dma2_s2cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA2_S2CR_PBURST_SHIFT		21
#define DMA2_S2CR_PBURST_MASK		0x03
/** @defgroup dma2_s2cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

